Public Member Functions | Friends | List of all members
ACAPI::MEP::FittingUIManager Class Referencefinal
MEP Element Manager
The FittingUIManager contains UI-related services for a Fitting. More...
#include <MEPFittingUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::FittingUIManager:
 Public Member Functions
Result< FittingDefault >  | CreateFittingDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a FittingDefault from a toolUIData.
Result< void >  | ApplyFittingDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const FittingDefault &fittingDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< FittingUIManager >  | CreateFittingUIManager ()
Creates a FittingUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The FittingUIManager contains UI-related services for a Fitting.
Since
Archicad 28
Member Function Documentation
◆ ApplyFittingDefaultToToolUIData()
 Result< void > ACAPI::MEP::FittingUIManager::ApplyFittingDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData & |  toolUIData,
|  const FittingDefault & |  fittingDefault )
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
fittingDefault | The default to be set
Returns
Returns error if the FittingDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateFittingDefaultFromToolUIData()
 Result< FittingDefault > ACAPI::MEP::FittingUIManager::CreateFittingDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData & |  toolUIData | )
Creates a FittingDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the Fitting in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an FittingDefault, otherwise returns the FittingDefault created from it.
Friends And Related Symbol Documentation
◆ CreateFittingUIManager
 Result< FittingUIManager > CreateFittingUIManager  |  ( |   | )
friend
Creates a FittingUIManager.
Returns
If able, creates a new manager for Fitting, otherwise Error.